files/requestWS/branch/envio/req_branch_RN02_019.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:bran="http://branch.webservices.taxbr.ta.thomsonreuters.com/">
     <soap:Header>  
   </soap:Header>	
   <soap:Body>
      <bran:receiveBranches>
         <!--Optional:-->
         <COMPANY_LIST>
	<COMPANY>
		<COD_COMPANY>076</COD_COMPANY>
		<BRANCH_LIST>
			<BRANCH>
				<IND_DELETE>N</IND_DELETE>
				<COD_BRANCH>WI453G</COD_BRANCH><!--ALTERAR ESSE CAMPO PARA INSERIR UM NOVO REGISTRO -->
				<DAT_INSERT_UPDATE>2003-01-01</DAT_INSERT_UPDATE>
				<NUM_FED_TAX>00910509033509</NUM_FED_TAX>
				<DSC_BRANCH>Estabelecimento WI453G</DSC_BRANCH>
				<IND_HEAD_OFFICE>N</IND_HEAD_OFFICE>
				<DSC_TRADE_NAME>Estabelecimento WI453C</DSC_TRADE_NAME>
				<COD_ECONO_ACTV>0133410</COD_ECONO_ACTV>
				<COD_PATIO_TYPE>AV</COD_PATIO_TYPE>
				<DSC_ADDRESS>Rua do efd social Tst</DSC_ADDRESS>
				<NUM_ADDRESS>1879</NUM_ADDRESS>
				<DSC_ADDRESS_COMPL>Fundos de outra empresa</DSC_ADDRESS_COMPL>
				<DSC_NEIGHBOURHOOD>Vila do Social</DSC_NEIGHBOURHOOD>
				<COD_ZIP>04500401</COD_ZIP>
				<NUM_POST_OFFICE_BOX>014512</NUM_POST_OFFICE_BOX>
				<NUM_DDD>11</NUM_DDD>
				<NUM_PHONE>21590098</NUM_PHONE>
				<NUM_FAX>21590500</NUM_FAX>
				<DSC_EMAIL>estabelecimento201@empresa076.com.br</DSC_EMAIL>
				<COD_STATE>SP</COD_STATE>
				<COD_CITY>3550308</COD_CITY>
				<COD_STATE_TAX>123456909</COD_STATE_TAX>
				<COD_MUNICIPAL_TAX>9886088</COD_MUNICIPAL_TAX>
				<PROPERTY_LIST>
					<PROPERTY>
						<COD_PROPERTY>CLASSIF_TRIB</COD_PROPERTY>
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>01</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>
					<PROPERTY>
						<COD_PROPERTY>NAT_JURIDICA</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>2160</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>
					<PROPERTY>
						<COD_PROPERTY>ALIQ_RAT</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>2</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>			
					<PROPERTY>
						<COD_PROPERTY>FAP</COD_PROPERTY> 
						<VALUE>0.75</VALUE>                           
					</PROPERTY>						
					<PROPERTY>
						<COD_PROPERTY>NUM_PROCESSO_RAT</COD_PROPERTY> 
						<VALUE>Proc RAT 1234</VALUE>                           
					</PROPERTY>  
					<PROPERTY>
						<COD_PROPERTY>TIPO_PROCESSO_RAT</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>2</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>						
					<PROPERTY>
						<COD_PROPERTY>NUM_PROCESSO_FAP</COD_PROPERTY> 
						<VALUE>Proc FAP 4321</VALUE>                           
					</PROPERTY>    
					<PROPERTY>
						<COD_PROPERTY>TIPO_PROCESSO_FAP</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>1</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>					
					<PROPERTY>
						<COD_PROPERTY>SIGLA_MIN</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>MDS</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>
					<PROPERTY>
						<COD_PROPERTY>NUM_CERTIFICADO</COD_PROPERTY> 
						<VALUE>Numero Certificado 009</VALUE>                           
					</PROPERTY>    
					<PROPERTY>
						<COD_PROPERTY>DAT_EMISSAO</COD_PROPERTY> 
						<VALUE>2013-03-31</VALUE>                           
					</PROPERTY>          
					<PROPERTY>
						<COD_PROPERTY>DAT_VENCTO</COD_PROPERTY> 
						<VALUE>2013-04-30</VALUE>                           
					</PROPERTY>   
					<PROPERTY>
						<COD_PROPERTY>NUM_PROT_RENOV</COD_PROPERTY> 
						<VALUE>Numero Protocolo 103</VALUE>                           
					</PROPERTY>                                                                                                           
					<PROPERTY>
						<COD_PROPERTY>DAT_PROT_RENOV</COD_PROPERTY> 
						<VALUE>2013-05-31</VALUE>                           
					</PROPERTY>          
					<PROPERTY>
						<COD_PROPERTY>DAT_DOU</COD_PROPERTY> 
						<VALUE>2013-06-30</VALUE>                           
					</PROPERTY>                                                                        
					<PROPERTY>
						<COD_PROPERTY>NUM_PAG_DOU</COD_PROPERTY> 
						<VALUE>12345</VALUE>                           
					</PROPERTY>    
					<PROPERTY>
						<COD_PROPERTY>IND_COOPERATIVA</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>2</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>
					<PROPERTY>
						<COD_PROPERTY>ACORDO_ISENCAO</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>0</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>		
					<PROPERTY>
						<COD_PROPERTY>SOCIO_OSTENSIVO</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>N</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>		
					<PROPERTY>
						<COD_PROPERTY>SIT_ESPECIAL</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>3</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>				
					<PROPERTY>
						<COD_PROPERTY>IND_DES_FOLHA</COD_PROPERTY>                                                
						<REFERENCE_LIST>
							<REFERENCE>
								<FIELD_REF>CODIGO</FIELD_REF>
								<VALUE_REF>0</VALUE_REF>
							</REFERENCE>
						</REFERENCE_LIST>
					</PROPERTY>																
				</PROPERTY_LIST>
			</BRANCH>
		</BRANCH_LIST>
	</COMPANY>
</COMPANY_LIST>
      </bran:receiveBranches>
   </soap:Body>
</soap:Envelope>